Repository: 84000/data-translation-memory
Catalog: toh314_84000-entry-into-the-gloomy-forest.tmx
Source language: bo
Languages: en

source: །ལྷ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ལ་སོགས་པ་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་རབ་མཐོང་ཆེན་པོས་ཅང་མི་སྨྲ་བས་དང་དུ་བླངས་པར་རིག་ནས་དགའ་མགུ་ཡི་རངས་པར་གྱུར་ཏོ།
en: And those gods, asuras, garuḍas, kinnaras, gandharvas, mahoragas, and so on happily rejoiced, as they knew that the venerable great Pradarśa had consented to the request by remaining quiet.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་མཐོང་ཆེན་པོས་སྟོན་པའི་ཞལ་དུ་ལྟ་བ་མཐོང་ནས་ཏ་མ་སའི་ནགས་སུ་སོང་སྟེ།
en: The venerable great Pradarśa then gazed intently at the Teacher’s face and left for the Gloomy Forest. Arriving there, he stood in the open air and struck the gaṇḍī, the sound of which was heard by the monks as it covered the whole of Jambudvīpa.

source: ཕྱིན་ནས་བླ་གབ་མེད་པར་འགྲེང་སྟེ་གཎ་ཌཱི་བརྡུངས་ཏེ་གཎ་ཌཱིའི་སྒྲ་དེས་འཛམ་བུའི་གླིང་ཁྱབ་པར་སྒྲ་གྲགས་པར་གྱུར་པ་ན་དགེ་སློང་དག་གིས་སྒྲ་ཐོས་ཏེ་སེམས་པ་ལ་ཞུགས་པ་དང་། སྒྲ་འདི་ནི་མུན་གྱི་ནགས་ནས་བྱུང་ངོ་སྙམ་མོ། །དེ་ཡང་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དག་གི་བཞུགས་གནས། རང་སངས་རྒྱས་རྣམས་ཀྱིས་གནས་བཅས་པ། འདོད་ཆགས་དང་བྲལ་བ་དག་དང་དྲང་སྲོང་དག་གི་གནས་སུ་གྱུར་པ་ཡིན་ལ་ད་ལྟར་ཡང་དེ་ཁོ་ན་བཙུན་པ་རབ་མཐོང་ཆེན་པོ་ཡིན་པར་གོ་ཞིང་ཤེས་ནས་མཐོང་སྟེ།
en: They began to think, “This sound has come from the Gloomy Forest.” This being an abode that was also inhabited by the previous perfect buddhas, by the solitary buddhas, by those without desire, and by the sages, the monks knew, understood, and saw that now the sound could only be from the honorable great Pradarśa.

source: དགྲ་བཅོམ་པ་ཁྲི་བརྒྱད་སྟོང་སྙེད་ཀྱིས་མུན་གྱི་ནགས་སུ་ཕྱིན་ཏེ་དབྱར་གྱི་གནས་པ་ཡང་བཅས།
en: Eighteen thousand worthy ones then traveled to the Gloomy Forest to undertake the summer rains retreat.

source: ཚངས་པ་ལྷའི་དབང་པོ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་དབུ་སྐྲ་དང་སེན་མོ་ཁྱེར་ཏེ།
en: Brahmā, the chief of the gods, and the Guardians of the World brought the hair and nails of the Thus-Gone One.

source: འོངས་ནས་དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་ཞིག་བཞེངས་སུ་གསོལ།
en: Having arrived, they erected a reliquary containing the hair and nails.

source: གཙུག་ལག་ཁང་ཞིག་ཀྱང་བརྩིགས། རྡོ་རྗེའི་གཙུག་ལག་ཁང་དུ་མཚན་གསོལ།
en: They also constructed a monastery, which was given the name Vajra Monastery.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞེས་ཀྱང་སོ་སོ་ནས་གཙུག་ལག་ཁང་རེ་རེ་བཞེངས་སུ་གསོལ། ལོ་དང་པོ་ལ་ལྷ་རྣམས་ཀྱིས་གནས་བཅས།
en: Brahmā, the lord of the Sahā world, and the Four Guardians of the World also built their own individual monasteries, and the gods resided in them for the first year.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རང་གི་ལག་ནས་ལོ་གཅིག་གི་ཆོས་གོས་ལ་སོགས་པ་ཡོ་བྱད་ཀྱི་རིན་སྦྱར།
en: For a full year, Śakra, chief of the gods, personally offered essential supplies such as monks’ robes.

source: ལྷའི་བུ་མོ་བདེ་སོགས་ཀྱིས་དགེ་སློང་རེ་རེ་ཞིང་རས་ཡུག་རེ་རེ་ཆོས་གོས་ཀྱི་རྒྱུ་ཡང་ཕུལ།
en: Apsarases such as Blissful also offered each monk cotton cloth for their monks’ robes.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་མཐོང་ཆེན་པོ་གནས་ཁང་དུ་ལྷའི་འཁོར་གྱིས་བསྐོར་ཏེ་གནས་བཅས་པ་ན་འདི་སྐད་ཅེས་སྨྲས་སོ། །གནས་བཅས་པ་འདི་ཡུན་རིང་གནས་བཅས་པར་འགྱུར་བའི་ཕྱིར་ལྷ་དང་མིའི་གྲོང་ཁྱེར་གནས་བཅའ་བའི་ཕྱིར་རྒྱལ་རིགས་རྩུབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པའི་མི་རྣམས་ལ་ཆོས་བསྟན་པས་ཡིད་རབ་ཏུ་དགའ་ཞིང་དད་པར་གྱུར་ཏེ།
en: Then the venerable great Pradarśa, situated in the large assembly hall and surrounded by a retinue of gods, said, “So that this place may be habitable for a long time to come and contain cities for gods and humans, I have taught the Dharma to people such as the kṣatriya known as Tough Man, and they have become pleased and devoted.

source: རྒྱལ་པོ་ཆེན་པོ་རྩུབ་པོས་དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་བྱས་གཞན་དག་ཀྱང་དད་པར་གྱུར་ཏེ།
en: The great king Tough Man has gone for refuge to the Three Jewels, and others have also become devotees.

source: ཕུག་ལྔ་བརྒྱའི་ལས་ཀྱང་བྱས།
en: Work has been done on five hundred caves.

source: དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ལྔ་བརྒྱ་ཡང་རབ་ཏུ་བྱུང་སྟེ། དགྲ་བཅོམ་པ་མངོན་དུ་བྱས།
en: Five hundred sages endowed with the five forms of superknowledge have also gone forth and achieved the realization of a worthy one.

source: གནས་དེ་ན་བྲམ་ཟེ་སྨྲ་བ་ལ་མཁས་པ་ཅིག་ཡོད་པ་དེ་ལས་རྒྱལ་བར་གྱུར་ཏེ་བཏུལ་ནས་རབ་ཏུ་བྱུང་སྟེ།
en: In this area, there is also a person who is an expert in the religion of the brahmins. I defeated him in debate, and he has gone forth.

source: དེས་ཀྱང་དགྲ་བཅོམ་པ་མངོན་དུ་བྱས་ཏེ།
en: He too has achieved the realization of a worthy one.”

source: ཏ་མ་སའི་ནགས་ན་ཚེ་དང་ལྡན་པ་རབ་མཐོང་ཆེན་པོ་ལ་སོགས་པ་དགྲ་བཅོམ་པ་ཁྲི་བརྒྱད་སྙེད་གནས་བཅས་སོ་ཞེས། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དང་གྲོང་ཁྱེར་དང་། གྲོང་ཁྱེར་ཀུན་ཏུ་གྲགས་པར་གྱུར།
en: Thus, it became well known in the palaces of kings and in the cities and towns that the venerable great Pradarśa, along with eighty thousand worthy ones, resided in the Gloomy Forest.

source: རྒྱལ་པོ་རྩུབ་པོ་ལ་སོགས་པ་མི་རྣམས་ནི་འཕགས་པའི་དགེ་འདུན་གྱི་སླད་དུ་ཉིན་རེ་བཞིན་དུ་དར་བ་འབུལ་མི་མ་ཡིན་པ་དག་ནི་དེ་བཞིན་དུ་ཞུན་མར་འབུལ་བར་བྱེད།
en: Every day, people such as King Tough Man offered buttermilk to the noble saṅgha.

source: གཞན་ཡང་དགའ་བ་དང་། དང་བས་མགུ་ཞིང་རངས་པས་ལེགས་པར་ལས་དང་བྱ་བ་ཡང་བྱེད་དོ།
en: The nonhumans offered ghee, and others, being happy and inspired, were pleased and rejoiced and offered their service.

source: །དེ་བཞིན་དུ་ཀླུ་དག་གིས་དགའ་བ་དང་མགུ་བས་ཐ་དད་པའི་བྱེ་བྲག་བཅྭ་བརྒྱད་ཀྱི་བཟའ་བ་དང་། བཅའ་བ་སྦྱར་བ་ཕུལ་ལོ།
en: Similarly, the nāgas, being happy and pleased, offered meals of eighteen different varieties.

source: །གཞན་ཡང་འདི་ལྟར་སྐྱེ་དགུའི་ལུས་ཅན་སེམས་བསྐྱེད་པ་འདི་ལྟ་སྟེ།
en: Other beings also developed a similar intention.

source: བློན་པོ་དང་རྒྱལ་རིགས་སྤྱིར་འདུས་ཏེ། ཀུན་དགའ་ར་བ་ཞིག་ཀྱང་བྱས་ཏེ། དེ་དག་ཏུ་མེ་ཏོག་གི་ཤིང་དང་། འབྲས་བུའི་ཤིང་མཛེས་པ་འདི་དག་སྟེ། ཨ་མྲའི་ཤིང་དང་། པ་ཏིའི་ཤིང་དང་། སེང་ལྡེང་གི་ཤིང་དང་། ནྱ་གྲོ་དྷའི་ཤིང་དང་། ཨ་ཤྭད་ཐའི་ཤིང་དང་། འབྲས་བུ་གསུམ་གྱི་ཤིང་དང་། མེ་ཏོག་ཙམ་པ་ཀའི་ཤིང་དང་། ཨུ་དུ་ཀའི་ཤིང་དང་། མ་དུ་ཀའི་ཤིང་དང་། བིལ་བའི་ཤིང་དང་། འབྲ་ཧོའི་ཤིང་དང་། འཛམ་བུའི་ཤིང་དང་། དུ་ནའི་ཤིང་དང་། ཆུ་ཤིང་ལ་སོགས་པ་དང་། མེ་ཏོག་མ་ལི་ཀ་དང་། ཀུན་ད་དང་། ཛ་ཧི་ཀ་ལ་སོགས་པ་མཛེས་པ་སྣ་ཚོགས་དགེ་སློང་བདེ་བར་གནས་པ་དགེ་བའི་ཕྱོགས་བྱེད་པ་དང་འཐུན་པ་ཞིག་ཀྱང་བྱས་ཏེ་དགེ་འདུན་ལ་ཕུལ་ལོ།
en: For example, the kṣatriyas and ministers cooperated to establish a park that contained many beautiful flowering and fruit-bearing trees, such as the mango tree, the trumpet flower tree, the cutch, the Indian banyan, the pipal tree, the three myrobalans, the campaka tree, the uduka tree, the licorice tree, the bel fruit tree, the braho tree, the black plum tree, the duna tree, and the banana plant. There were also flowers such as arabian jasmine, downy jasmine, and common jasmine. The rulers and ministers then offered this park to the saṅgha so that the monks would be able to live comfortably and have an abode conducive to wholesome pursuits.

source: །དེ་ནས་དགེ་སློང་དག་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཚེ་དང་ལྡན་པ་རབ་མཐོང་གིས་ལས་ཅི་བགྱིས་ན་ལས་གང་ཡང་རྣམ་པར་སྨིན་པ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་དང་ལྡན་པའི་རིགས་སུ་སྐྱེས། གཟུགས་མཛེས་ཤིང་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར། བསོད་ནམས་ཆེན་པོ་དང་ལྡན་པ་ཤེས་པར་འཚལ་ལགས་སོ་ཞེས་ཞུས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Later, however, the monks came to have doubts, and so they asked the blessed Buddha, who quells all doubts, “What action did the honorable and venerable Pradarśa previously perform so that now, as this action ripens, he is rich, wealthy, and born in a prosperous lineage, so that he is handsome and the one most highly revered by gods and humans, and so that he is endowed with a great amount of merit? Please make this known to us!”

source: དགེ་སློང་དག་འདས་པའི་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: The Blessed One responded, “O monks, ninety-one eons ago, the perfect Buddha Vipaśyin appeared in the world.

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: He was perfect in terms of wisdom and conduct, a well-gone one, a knower of the world, a charioteer for beings, an unsurpassed being, a teacher of gods and humans, and a blessed buddha.

source: རྒྱལ་པོ་གཉེན་ལྡན་གྱི་ཁབ་ན་བཞུགས་ཏེ།
en: He resided in King Bandhumat’s palace.

source: དུས་དེའི་ཚེ་ཞལ་ཞལ་མཁན་གྱི་རིགས་ལས་ཕྱུག་པ་ག་གེ་མོ་ཞེས་བྱ་བ་ཞིག་གིས་རྣམ་པར་གཟིགས་ཀྱི་སླད་དུ་གཙུག་ལག་ཁང་བརྩིགས་ཏེ།
en: At that time, a certain rich man from the caste of plasterers built a monastery for Vipaśyin.

source: མེ་ཏོག་དང་འབྲས་བུའི་ཤིང་ལེགས་པར་བཙུགས་ཏེ། ཀུན་ཏུ་དྲི་བསུང་གི་ངད་དང་ལྡན་པ་འབྱུང་བར་འགྱུར་ཏེ་ཕུལ།
en: Landscaping it beautifully with flowers and fruit-bearing trees, the man offered the monastery, which was enveloped by pleasing scents , to Vipaśyin.

source: སྟོན་པ་དེ་ཉིད་ཀྱི་བསྟན་པ་ལ་ཡང་རབ་ཏུ་བྱུང་།
en: He also went forth under the teaching of that very Teacher.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་མྱ་ངན་ལས་འདས་ནས་སྐུ་གདུང་གི་མཆོད་རྟེན་གྱི་རྨང་གི་འོག་ཏུ་རིན་པོ་ཆེའི་རྡོ་རིང་ཅིག་བསྒྲེང་ངོ་།
en: After the perfect Buddha Vipaśyin had passed into nirvāṇa, this monk erected a precious pillar at the foundation of the reliquary that held the Buddha’s relics.

source: །ཞལ་ཞལ་མཁན་གྱི་རིགས་ལས་རབ་ཏུ་བྱུང་བ་དེའི་འཁོར་མང་པོ་ཡང་རྗེས་སུ་ཡི་རང་ཞིང་མོས་པར་གྱུར་ཏེ།
en: The people in the retinue of this monk, who had gone forth from the caste of plasterers, rejoiced and felt admiration. Then they made the following aspiration:

source: ཁྱེད་སྟོན་པ་ལ་མོས་པར་གྱུར་པ་དེ་བཞིན་དུ་བདག་ཅག་ཀྱང་དད་ཅིང་མོས་པར་བགྱིད་དེ།
en: ‘Just as you admire the Teacher, may we too have faith and admiration.

source: སྟོན་པའི་བཀའ་བཞིན་དུ་བགྱིད་ཅིང་མཉེས་པར་བགྱིད་ལ་མི་མཉེས་པར་མ་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ།
en: May we act according to the words of the Teacher and please him. May we not displease him.’ “O monks, what do you think?

source: །དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ་དེའི་དུས་ན་ཞལ་ཞལ་མཁན་གང་ཡིན་པ་དེ་ནི་ཚེ་དང་ལྡན་པ་རབ་མཐོང་ཆེན་པོ་ཉིད་ཡིན་ལ།
en: At that time, on that occasion, the person who was the plasterer is none other than the venerable great Pradarśa.

source: སྐྱེ་དགུའི་ལུས་ཅན་དེ་དག་ནི་ད་ལྟར་གྱི་ལྷ་དང་མི་འདི་དག་ཡིན་ཏེ་ད་ལྟར་ཡང་འདུལ་བར་བྱེད་པ་ཡིན་ནོ། །གཞན་ཡང་བཅོམ་ལྡན་འདས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: Similarly, those other beings are these gods and humans present here, and now too he is guiding them. “Moreover, he went forth under the teaching of the Blessed Kāśyapa, and his preceptor was the one who was the one most highly revered by gods and humans. He made the following aspiration:

source: དེའི་མཁན་པོ་ནི་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡིན་ཏེ་ཇི་ལྟར་བདག་གི་མཁན་པོ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་དེ་བཞིན་དུ་བདག་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པའི་བསྟན་པ་ལ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ། །དེས་ན་ད་ལྟར་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡིན་ནོ།
en: ‘Just as my preceptor is the one most highly revered by gods and humans, may I too, under the teaching of the perfect Buddha Śākyamuni, become the one most highly revered by gods and humans.’ For that reason, he has now become the one most highly revered by gods and humans.

source: །དེ་ལྟ་བས་ན་དགེ་སློང་དག་གཅིག་ཏུ་གནག་པའི་ལས་ནི་རྣམ་པར་སྨིན་པ་ཡང་གཅིག་ཏུ་གནག་གོ།
en: “Therefore, O monks, the ripening of thoroughly black deeds is thoroughly black.

source: །རབ་ཏུ་དཀར་བ་ལས་ནི་དཀར་བའོ།
en: The ripening of truly white deeds is white.

source: །འདྲེས་པ་ལ་ནི་འདྲེས་པའོ།
en: The ripening of mixed deeds is mixed.

source: །དེ་བས་ན་དགེ་སློང་དག་རབ་ཏུ་གནག་པ་དང་འདྲེས་མ་དག་ནི་སྤོངས་ཤིག །རབ་ཏུ་དཀར་བ་དག་ལ་སྤྱད་པར་བྱ་སྟེ།
en: For that reason, O monks, abandon truly black deeds and mixed deeds. You must carry out those deeds that are truly white.

source: དགེ་སློང་དག་དེ་བཞིན་དུ་བསླབ་པར་གྱིས་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། དགེ་སློང་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་ཡིད་ལ་བྱེད་དེ་མངོན་པར་དགའོ།
en: Monks, you should train in this way!” When the Blessed One had said this, the monks contemplated the Blessed One’s speech and were pleased.

source: །མུན་གྱི་ནགས་ཚལ་གྱི་སྒོ་ཞེས་བྱ་བའི་མདོ་རྫོགས་སོ།།
en: This completes the sūtra “Entry into the Gloomy Forest.”

source: །།བྱང་ཕྱོགས་རྒྱུད་ཀྱི་ཕྲེང་བའི་མདོ་ཁྲི་པའི་ནང་ནས་ཡུལ་ཟ་ལེན་དྲའི་བྱང་ཕྱོགས་ཀྱི་མཚམས་ཀྱི་རི། ཨུ་ཤི་རིའི་བསྔགས་པའོ།།
en: From the ten-thousand-lined Sūtra of the Garland of the Northern Range , this is a description of Mount Uśīra, which is the northern border mountain of the Jālandhara region.
